[
    {
        "title": "Noxer",
        "description": "AI-продукт, предоставляющий бизнесам (по подписке) полностью контролируемый интернет-магазин в Telegram Miniapps с настраивым ИИ-помощником.",
        "cases": [
            "Разрабатывал и поддерживал универсальную систему интернет-магазинов и админки для него", 
            "Разрабатывал и поддерживал модульную архитектуру приложения (FSD)",
            "Оптимизировал сложные UI элементы, прорабатывал пользовательские сценариев и улучшение UX",
            "Интегрировал Telegram WebApp",
            "Участвовал в архитектурных решениях и ревью кода",
            "Разработал файловый менеджер (работа с иерархией, состояниями, UI-логикой)"
        ],
        "logo": "/assets/imgs/experiences/noxer.webp",
        "dates": "Октябрь 2024 — Январь 2026",
        "langs": ["React", "Redux/RTK", "TypeScript", "SCSS", "Vite", "Git"]
    },
    {
        "title": "Product Team",
        "description": "Разработка и поддержка различных проектов работающих через Telegram WebApp, включающей интернет-магазин и аналитическую панель для работы с данными пользователей и заказов.",
        "cases": [
            "Разработал Telegram WebApp магазин цветов с нуля (витрина, карточки товаров, корзина, оформление заказа, личный кабинет)",
            "Интегрировал платежную систему ЮMoney",
            "Интегрировал API Яндекс.Еды",
            "Разработал админ-панель для управления контентом магазина",
            "Реализовал аналитическую панель с визуализацией статистики (графики, метрики)",
            "Разработал систему пагинации: ускорение загрузки каталога (с 3 сек до 0.5 сек при 1000+ товаров)",
            "Настроил взаимодействие с бэкендом через REST API",
            "Реализовал систему скидок и промокодов",
            "Разрабатывал адаптивный UI и улучшал пользовательские сценарии",
            "Предлагал идеи по улучшению интерфейса"
        ],
        "logo": "/assets/imgs/experiences/team.webp",
        "dates": "Октябрь 2024 — Январь 2026",
        "langs": ["React", "Redux", "TypeScript", "SCSS", "Vite"]
    }
]