[
  {
    "title": "Noxer",
    "description": "AI-продукт, предоставляющий бизнесам (по подписке) полностью контролируемый интернет-магазин в Telegram Web App с настраиваемым  ИИ-помощником.",
    "cases": ["Разрабатывал и поддерживал универсальную систему интернет-магазинов (более 20 бизнесов) и админки для него", "Разрабатывал и поддерживал модульную архитектуру приложения (FSD)", "Оптимизировал сложные UI элементы, прорабатывал пользовательские сценарии и улучшал UX", "Интегрировал Telegram WebApp", "Участвовал в архитектурных решениях и ревью кода", "Разработал файловый менеджер (работа с иерархией, состояниями, UI-логикой)"],
    "logo": "/assets/imgs/experiences/noxer.webp",
    "dates": "Октябрь 2024 — Февраль 2026 (1 год 5 месяцев)",
    "langs": ["React", "Redux/RTK", "TypeScript", "SCSS", "Vite", "Git"]
  },
  {
    "title": "Freelance",
    "description": "Разработка и поддержка различных проектов работающих через Telegram WebApp, включающей интернет-магазин и аналитическую панель для работы с данными пользователей и заказов.",
    "cases": ["Разработал Telegram WebApp магазин цветов с нуля (витрина, карточки товаров, корзина, оформление заказа, личный кабинет)", "Интегрировал платежную систему ЮMoney", "Интегрировал API Яндекс.Еды", "Разработал админ-панель для управления контентом магазина", "Реализовал аналитическую панель с визуализацией статистики (графики, метрики)", "Разработал систему пагинации: ускорение загрузки каталога (с 3 сек до 0.5 сек при 1000+ товаров)", "Настроил взаимодействие с бэкендом через REST API", "Реализовал систему скидок и промокодов", "Разрабатывал адаптивный UI и улучшал пользовательские сценарии", "Предлагал идеи по улучшению интерфейса"],
    "logo": "/assets/imgs/experiences/team.webp",
    "dates": "Май 2024 — Октябрь 2024 (6 месяцев)",
    "langs": ["React", "Redux", "TypeScript", "SCSS", "Vite"]
  },
  {
    "title": "SIBDEV",
    "description": "Студия, разработка веб-сервисов, SaaS-платформ и корпоративных систем.",
    "cases": ["Реализовывал сложные интерфейсы: дашборды, системы автопостинга, личные кабинеты, админ-панели", "Реализовал систему автопостинга с интеграцией соцсетей (Instagram, YouTube, Telegram, VK)", "Внедрил lazy-loading и code-splitting, уменьшив размер сборки (основной bundle) на 50%", "Реализовал бесконечную прокрутку таблиц ускорив загрузку контента с 30 сек до 0.5 сек.", "Реализовал личный кабинет с подписками и оплатами, автоматизировав процесс подключения услуг (снижение ручной обработки заявок до 0)"],
    "logo": "/assets/imgs/experiences/sibdev.webp",
    "dates": "Август 2022 — Май 2024 (1 год 10 месяцев)",
    "langs": ["React", "Redux", "SCSS", "Webpack"]
  }
]
