[
  {
    "title": "Noxer",
    "description": "Универсальный ИИ магазин в Telegram Web App",
    "fullDescription": "AI-продукт, предоставляющий бизнесам (по подписке) полностью контролируемый интернет-магазин в Telegram Web App с настраиваемым ИИ-помощником.<br/><br/>Участвовал в разработке, разрабатывал универсальный магазин и админ-панель для его контроля. Выделить конкретно то, что я делал, трудно, так как ко всему интерфейсу в проекте я приложил руку в той или иной степени.<br/><br/>Можно было бы разделить этот проект на два, потому что админка получилась очень массивная. Была проделана колоссальная работа над админкой и магазином. Очень много контента и возможностей.",
    "logo": "/assets/imgs/projects/noxer/logo.webp",
    "images": ["/assets/imgs/projects/noxer/1.jpg", "/assets/imgs/projects/noxer/2.jpg", "/assets/imgs/projects/noxer/3.jpg", "/assets/imgs/projects/noxer/4.png", "/assets/imgs/projects/noxer/5.png", "/assets/imgs/projects/noxer/6.png", "/assets/imgs/projects/noxer/7.png"],
    "link": "https://noxer.ru",
    "github": "",
    "comercial": false,
    "langs": ["React", "TypeScript", "SCSS", "Vite", "Telegram", "Telegram"]
  },
  {
    "title": "Fit+",
    "description": "Приложение фитнес-трекер в Telegram",
    "fullDescription": "ИИ фитнес-тренер, который создает план питания и тренировок под пользователя и доступен 24/7.<br/><br/>Проект разрабатывался в команде Noxer, его идея была в анализе данных, которые вводил пользователь. В бот были встроены различные ИИ-модели, и можно было вписать информацию о своей тренировке, и в формате диалога бот выделял значения для анализа и записывал их в общую БД.<br/>Мы, фронтенд-разработчики, разрабатывали интерфейс приложения в Telegram Web App. Сложнее всего было работать с графиками и отрисовывать их в совместимости с макетом. Но со своей задачей мы справились! Всё работает так, как задумывалось.<br/><br/>В данный момент проект находится на паузе, так как было принято решение сконцентрироваться на флагманском проекте Noxer.",
    "logo": "/assets/imgs/projects/fit/logo.png",
    "images": ["/assets/imgs/projects/fit/1.png", "/assets/imgs/projects/fit/2.png", "/assets/imgs/projects/fit/3.png", "/assets/imgs/projects/fit/4.png", "/assets/imgs/projects/fit/5.png", "/assets/imgs/projects/fit/6.png"],
    "link": "",
    "github": "",
    "comercial": false,
    "langs": ["React", "TypeScript", "SCSS", "Vite", "Telegram"]
  },
  {
    "title": "LF Safe",
    "description": "Сервис продажи брендовых кроссовок.",
    "fullDescription": "Сервис продажи и покупки брендовых кроссовок. Узконаправленный локальный проект для конкретной группы пользователей.<br/><br/>Принимал участие в разработке приложения в небольшой команде. Разрабатывал интерфейс с нуля по макету конкурентов (некоторые изменения в дизайн были внесены в момент разработки). В основном работал с бэкенд-разработчиком.<br/><br/>В приложении есть аналитика продаж, CRUD товаров, поиск, информация о профиле.",
    "logo": "/assets/imgs/projects/lfsafe/logo.png",
    "images": ["/assets/imgs/projects/lfsafe/1.jpg", "/assets/imgs/projects/lfsafe/2.jpg", "/assets/imgs/projects/lfsafe/3.jpg"],
    "link": "",
    "github": "",
    "comercial": false,
    "langs": ["React", "Redux", "JavaScript", "SCSS"]
  },
  {
    "title": "Магазин цветов",
    "description": "Интернет-магазин встроенный в Telegram.",
    "fullDescription": "Интернет-магазин по продаже цветов. Находился в Telegram WebApp в виде бота. <br />Разрабатывал на заказ, для магазина цветов, с ещё одним backend-разработчиком. Продолжительное время вносили правки в проект. В конечном итоге приложением почти никто не пользовался и сервер перестали оплачивать, концентрируясь на сервисах Яндекс.",
    "logo": "/assets/imgs/projects/dff/logo.png",
    "images": ["/assets/imgs/projects/dff/1.png", "/assets/imgs/projects/dff/2.png", "/assets/imgs/projects/dff/3.png"],
    "link": "",
    "github": "",
    "comercial": false,
    "langs": ["React", "Redux", "JavaScript", "SCSS"]
  }
]
